app/models/user.rb

SELECT  "users".* FROM "users" WHERE (lower(username) = 'thomas.perus@espeme.com' OR lower(email)= 'thomas.perus@espeme.com') ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def self.find_first_by_auth_conditions(warden_conditions)
    conditions = warden_conditions.dup
    if login = conditions.delete(:login)
      where(conditions.to_hash).where("lower(username) = :value OR lower(email)= :value", value: login.downcase).first